package com.semnan.semnanuniversity.data.datasources

import android.content.Context
import com.semnan.semnanuniversity.R
import com.semnan.semnanuniversity.data.model.Faculty
import com.semnan.semnanuniversity.data.model.MainItems
import dagger.hilt.android.qualifiers.ApplicationContext
import javax.inject.Inject

class MainLocalDataSource @Inject constructor(@ApplicationContext private val mContext: Context) {

    fun getMainItems(): List<MainItems>{
        return listOf(
            MainItems("tour", R.drawable.virtual_tour_logo, mContext.getString(R.string.virtual_tour_semnan)),
            MainItems("intro_to_semnan_uni", R.drawable.semnan_intro, mContext.getString(R.string.intro_semnan)),
            MainItems("intro_to_semnan_city", R.drawable.semnan_city_intro, mContext.getString(R.string.intro_semnan_city)),
            MainItems("daneshkade_ha", R.drawable.c1, mContext.getString(R.string.daneshkade_ha)),
            MainItems("moavenat_ha", R.drawable.i1, mContext.getString(R.string.moavenat_ha)),
            MainItems("ostad_ha", R.drawable.profesor2, mContext.getString(R.string.ostad_ha)),
            MainItems("reshte_ha", R.drawable.majors, mContext.getString(R.string.majors)),
            MainItems("news", R.drawable.news, mContext.getString(R.string.news)),
            MainItems("shmare_ha", R.drawable.phone, mContext.getString(R.string.phones)),
            MainItems("dastavard", R.drawable.achiv, mContext.getString(R.string.achievement)),
            MainItems("pardis_map", R.drawable.pardis_logo, mContext.getString(R.string.pardis_map)),
            MainItems("city_map", R.drawable.city_map, mContext.getString(R.string.city_map)),
            MainItems("book", R.drawable.simorgh, mContext.getString(R.string.simorgh))
        )
    }

    fun getFacultyItems(): List<Faculty>{
        return listOf(
            Faculty(
                "دانشکده مهندسی برق و کامپیوتر",
                        "گروه برق، فعاليت آموزشي خود را در دهة پنجاه با برگزاري دورة کارداني در رشته برق و الکترونيک شروع کرد. رشته مهندسي الکترونيک به عنوان اولين رشته کارشناسي در «مدرسه عالي تکنولوژي» آن زمان در سال 1367 تأسيس گرديد. با پذيرش دانشجو در گرايش قدرت در سال 1375 و کارشناسي ارشد الکترونيک در سال 1376 و به دنبال آن کارشناسي ارشد  برق - قدرت و دکتري برق- قدرت در سال 1382دامنه فعاليت اين گروه آموزشي به تمام مقاطع تحصيلي مهندسي برق و سپس کارشناسي کامپيوتر در سه گرايش گسترش يافت .\n" +
                        "نهايتاً  در سال 1387 دانشکده مهندسي برق و کامپيوتر تأسيس گرديد. در حال حاضر اين دانشکده داراي 7 رشته - گرايش در مقطع کارشناسي و 10 رشته گرايش در مقطع کارشناسي ارشد و 8 رشته - گرايش در مقطع دکتري ميباشد.\n" +
                        "گروه های آموزشی:\n" +
                        "الکترونیک، مخابرات، قدرت، کنترل، نرم افزار، سخت افزار، فناوری اطلاعات ،افزاره هاي ميكرو و نانو،الكترونيك، مدارهاي مجتمع الکترونیک، الکترونیک، مخابرات (میدان و موج)، مخابرات (سیستم)، فتونیک، الكترونيك قدرت و ماشين، سیستم هاي قدرت، مدیریت انرژي، قدرت، کنترل ، مگاترونیک ، هوش مصنوعی.\n" +
                        "امکانات:\n" +
                        "آزمايشگاه مدار و اندازه گيري، آزمايشگاه اجزاي کامپيوتر، آزمايشگاه ميکروپروسسور، آزمايشگاه کنترل خطي، آزمايشگاه ماشين هاي الکتريکي، آزمايشگاه مدارهاي منطقي،آزمايشگاه عايق و فشار قوي، آزمايشگاه اتوماسيون و رباتيک، آزمايشگاه الکترونيک و پالس، آزمايشگاه مدارهاي مخابراتي، آزمايشگاه پردازش سيگنال هاي ديجيتال، آزمايشگاه سيستم هاي قدرت، آزمايشگاه مباني برق، آزمايشگاه کنترل صنعتي ،آزمايشگاه ابزار دقيق، آزمايشگاه کنترل ديجيتال، آزمايشگاه VLSI ، آزمايشگاه پايگاه داده، آزمايشگاه سيستم عامل، آزمايشگاه شبکه هاي رايانه اي، آزمايشگاه سازمان رايانه، آزمايشگاه سيستم انتقال، آزمايشگاه آنتن، آزمايشگاه سيستم تلويزيون، آزمايشگاه ماشين مخصوص، آزمايشگاه الکترونيک صنعتي، آزمايشگاه مايکروويو، آزمايشگاه سيستم هاي مخابرات نوري، آزمايشگاه سيستمهاي انتقال، آزمايشگاه سيستمهاي سوئيچينگ، آزمايشگاه مدارهاي واسط، آزمايشگاه شبكه هاي كامپيوتري، آزمايشگاه الكترونيك ديجيتال، آزمايشگاه معماري رايانه اي، آزمايشگاه ريزپردازنده، کارگاه برق، آزمايشگاه رله و حفاظت و تست رله هاي سيستم قدرت، کارگاه مدار فرمان و مرکز تحقيقات IT، آزمايشگاه پايگاه داده و محاسبات سنگين، آزمايشگاه الکترونيک ديجيتال، آزمايشگاه منطقي و معماري، آزمايشگاه ريزپردارنده، آزمايشگاه ريز پردارنده پيشرفته\n"
                ,
                R.drawable.c1,
                "02331532699",
                "https://www.google.com/maps/place/%D8%AF%D8%A7%D9%86%D8%B4%DA%A9%D8%AF%D9%87+%D9%85%D9%87%D9%86%D8%AF%D8%B3%DB%8C+%D8%A8%D8%B1%D9%82+%D9%88+%DA%A9%D8%A7%D9%85%D9%BE%DB%8C%D9%88%D8%AA%D8%B1%E2%80%AD/@35.6002904,53.4335808,300m/data=!3m1!1e3!4m5!3m4!1s0x0:0x5c4789a2863bf148!8m2!3d35.5999309!4d53.4331548",
                "http://ece.semnan.ac.ir/"
            ),
            Faculty(
                "دانشکده مهندسی عمران",
                "گروه مهندسي عمران در سال 1371با پذيرش دانشجو در مقطع کارشناسي در گرايش مهندسي عمران از زير مجموعه دانشکده مهندسي فعاليت خود را آغاز نمود. اين گروه از سال 1377 با پذيرش اولين گروه از دانشجويان کارشناسي ارشد سازه فعاليت تحصيلات تکميلي خود را آغاز نموده و در سال 1389 نيز اولين گروه از دانشجويان دورة دکتري مهندسي عمران از اين دانشکده فارغ التحصيل گرديدند.\n" +
                        "نهايتاً  در سال 1387 اين گروه به دانشکده مهندسي عمران ارتقاء يافت . در حال حاضر اين دانشکده با داشتن  1 رشته  - گرايش در مقطع کارشناسي و 6 رشته - گرايش در مقطع کارشناسي ارشد و 7 رشته - گرايش در مقطع دکتري مي باشد.\n" +
                        "رشته و گرایش های تحصیلی:\n" +
                        "مهندسي و مديريت منابع اب، مهندسي عمران، خاك و پي،  سازه، زلزله، مهندسي آب و سازه هاي هيدروليكي، راه و ترابري، ژئوتكنيك، مكانيك خاك و پي، مهندسي و مديريت ساخت.\n" +
                        " امکانات :\n" +
                        "آزمايشگاه پژوهشي سازه، آزمايشگاه قير و آسفالت، آزمايشگاه مکانيک خاک، آزمايشگاه پژوهشي هيدروليک، کارگاه نقشه برداري، آزمايشگاه مصالح ساختماني و تکنولوژي بتن.\n"
                        ,
                R.drawable.c2,
                "02331535200",
                "http://www.google.com/maps/place/Faculty+of+Civil+Engineering,+Semnan+University/@35.6060304,53.4332787,299m/data=!3m1!1e3!4m5!3m4!1s0x0:0xe94e8fcd40b2bf4a!8m2!3d35.6060304!4d53.4341955",
                "http://civil.semnan.ac.ir/"
            ),
            Faculty(
                "دانشکده مهندسی مکانیک",
                "\n" +
                        "    <Text>گروه مکانيک، از سال 1353 همزمان با تأسيس مدرسه عالي تکنولوژي سمنان، با پذيرش دانشجو دردو رشتة کارداني فعاليت خود را شروع کرد. اين گروه درسال 1374 با پذيرش دانشجو در مقطع کارشناسي و در سال 1381 در مقطع کارشناسي ارشد و در سال 1385 در مقطع دکتري فعاليتهاي خود را گسترش داد.\n" +
                        "نهايتاً  در سال 1389 اين گروه به دانشکده مهندسي مکانيک ارتقاء يافت. در حال حاضر اين دانشکده داراي 2رشته - گرايش در مقطع کارشناسي و 4 رشته -گرايش در مقطع کارشناسي ارشد و 7 رشته - گرايش در مقطع دکتري ميباشد.\n" +
                        "\n" +
                        "رشته و گرایش های تحصیلی:\n" +
                        "ساخت و  تولید، طراحي كاربردي- ديناميك، كنترل و ارتعاشات، طراحي كاربردي- مكانيك جامدات، تبديل انرژي، طراحي كاربردي، مهندسي مكانيك.\n" +
                        "\n" +
                        "\n" +
                        "امکانات:\n" +
                        "\n" +
                        "آزمايشگاه هاي تحقيقاتي:\n" +
                        "آزمايشگاه آناليز مودال، آزمايشگاه تست موتور، آزمايشگاه مکانيک ضربه، آزمايشگاه کاليبراسيون دما و فشار، آزمايشگاه انرژي و محيط متخلخل، آزمايشگاه انتقال حرارت پيشرفته، آزمايشگاه تونل باد عمودي، آزمايشگاه کاويتاسيون، آزمايشگاه رفتار مواد پيشرفته\n" +
                        "\n" +
                        "آزمايشگاه ها و کارگاه هاي آموزشي :\n" +
                        "آزمايشگاه ترموديناميک، آزمايشگاه پنوماتيک و هيدروليک، آزمايشگاه CNC، آزمايشگاه CAD/CAM، آزمايشگاه مکانيک سيالات، آزمايشگاه مقاومت مصالح، آزمايشگاه انتقال حرارت، آزمايشگاه ديناميک ماشين و ارتعاشات، آزمايشگاه سيستم هاي اندازه گيري، کارگاه جوشکاري و ورقکاري، کارگاه ماشين ابزار، کارگاه اتومکانيک.\n",
                R.drawable.c3,
                "02331532399",
                "https://www.google.com/maps/place/%D8%AF%D8%A7%D9%86%D8%B4%DA%A9%D8%AF%D9%87+%D9%85%DA%A9%D8%A7%D9%86%DB%8C%DA%A9%E2%80%AD/@35.5986856,53.4326774,178m/data=!3m2!1e3!4b1!4m5!3m4!1s0x3f9bb307f2c05ceb:0xddca06dbb8bc50b8!8m2!3d35.5986856!4d53.4332246",
                "http://mechanic.semnan.ac.ir/"
            ),
            Faculty(
                "",
                "",
                R.drawable.i1,
                "",
                "",
                ""
            ),
            Faculty(
                "",
                "",
                R.drawable.i1,
                "",
                "",
                ""
            ),
            Faculty(
                "",
                "",
                R.drawable.i1,
                "",
                "",
                ""
            ),
            Faculty(
                "",
                "",
                R.drawable.i1,
                "",
                "",
                ""
            ),
            Faculty(
                "",
                "",
                R.drawable.i1,
                "",
                "",
                ""
            ),
            Faculty(
                "",
                "",
                R.drawable.i1,
                "",
                "",
                ""
            ),
            Faculty(
                "",
                "",
                R.drawable.i1,
                "",
                "",
                ""
            )
        )
    }


}