package com.semnan.semnanuniversity.data.datasources

import android.content.Context
import com.semnan.semnanuniversity.R
import com.semnan.semnanuniversity.data.model.Faculty
import com.semnan.semnanuniversity.data.model.MainItems
import dagger.hilt.android.qualifiers.ApplicationContext
import javax.inject.Inject

class MainLocalDataSource @Inject constructor(@ApplicationContext private val mContext: Context) {

    fun getMainItems(): List<MainItems>{
        return listOf(
            MainItems("tour", R.drawable.virtual_tour_logo, mContext.getString(R.string.virtual_tour_semnan)),
            MainItems("intro_to_semnan_uni", R.drawable.semnan_intro, mContext.getString(R.string.intro_semnan)),
            MainItems("intro_to_semnan_city", R.drawable.semnan_city_intro, mContext.getString(R.string.intro_semnan_city)),
            MainItems("daneshkade_ha", R.drawable.c1, mContext.getString(R.string.daneshkade_ha)),
            MainItems("moavenat_ha", R.drawable.i1, mContext.getString(R.string.moavenat_ha)),
            MainItems("ostad_ha", R.drawable.profesor2, mContext.getString(R.string.ostad_ha)),
            MainItems("reshte_ha", R.drawable.majors, mContext.getString(R.string.majors)),
            MainItems("news", R.drawable.news, mContext.getString(R.string.news)),
            MainItems("shmare_ha", R.drawable.phone, mContext.getString(R.string.phones)),
            MainItems("dastavard", R.drawable.achiv, mContext.getString(R.string.achievement)),
            MainItems("pardis_map", R.drawable.pardis_logo, mContext.getString(R.string.pardis_map)),
            MainItems("city_map", R.drawable.city_map, mContext.getString(R.string.city_map)),
            MainItems("book", R.drawable.simorgh, mContext.getString(R.string.simorgh))
        )
    }

    fun getFacultyItems(): List<Faculty>{
        return listOf(
            Faculty(
                "1",
                "دانشکده مهندسی برق و کامپیوتر",
                        "گروه برق، فعاليت آموزشي خود را در دهة پنجاه با برگزاري دورة کارداني در رشته برق و الکترونيک شروع کرد. رشته مهندسي الکترونيک به عنوان اولين رشته کارشناسي در «مدرسه عالي تکنولوژي» آن زمان در سال 1367 تأسيس گرديد. با پذيرش دانشجو در گرايش قدرت در سال 1375 و کارشناسي ارشد الکترونيک در سال 1376 و به دنبال آن کارشناسي ارشد  برق - قدرت و دکتري برق- قدرت در سال 1382دامنه فعاليت اين گروه آموزشي به تمام مقاطع تحصيلي مهندسي برق و سپس کارشناسي کامپيوتر در سه گرايش گسترش يافت .\n" +
                        "نهايتاً  در سال 1387 دانشکده مهندسي برق و کامپيوتر تأسيس گرديد. در حال حاضر اين دانشکده داراي 7 رشته - گرايش در مقطع کارشناسي و 10 رشته گرايش در مقطع کارشناسي ارشد و 8 رشته - گرايش در مقطع دکتري ميباشد.\n" +
                        "گروه های آموزشی:\n" +
                        "الکترونیک، مخابرات، قدرت، کنترل، نرم افزار، سخت افزار، فناوری اطلاعات ،افزاره هاي ميكرو و نانو،الكترونيك، مدارهاي مجتمع الکترونیک، الکترونیک، مخابرات (میدان و موج)، مخابرات (سیستم)، فتونیک، الكترونيك قدرت و ماشين، سیستم هاي قدرت، مدیریت انرژي، قدرت، کنترل ، مگاترونیک ، هوش مصنوعی.\n" +
                        "امکانات:\n" +
                        "آزمايشگاه مدار و اندازه گيري، آزمايشگاه اجزاي کامپيوتر، آزمايشگاه ميکروپروسسور، آزمايشگاه کنترل خطي، آزمايشگاه ماشين هاي الکتريکي، آزمايشگاه مدارهاي منطقي،آزمايشگاه عايق و فشار قوي، آزمايشگاه اتوماسيون و رباتيک، آزمايشگاه الکترونيک و پالس، آزمايشگاه مدارهاي مخابراتي، آزمايشگاه پردازش سيگنال هاي ديجيتال، آزمايشگاه سيستم هاي قدرت، آزمايشگاه مباني برق، آزمايشگاه کنترل صنعتي ،آزمايشگاه ابزار دقيق، آزمايشگاه کنترل ديجيتال، آزمايشگاه VLSI ، آزمايشگاه پايگاه داده، آزمايشگاه سيستم عامل، آزمايشگاه شبکه هاي رايانه اي، آزمايشگاه سازمان رايانه، آزمايشگاه سيستم انتقال، آزمايشگاه آنتن، آزمايشگاه سيستم تلويزيون، آزمايشگاه ماشين مخصوص، آزمايشگاه الکترونيک صنعتي، آزمايشگاه مايکروويو، آزمايشگاه سيستم هاي مخابرات نوري، آزمايشگاه سيستمهاي انتقال، آزمايشگاه سيستمهاي سوئيچينگ، آزمايشگاه مدارهاي واسط، آزمايشگاه شبكه هاي كامپيوتري، آزمايشگاه الكترونيك ديجيتال، آزمايشگاه معماري رايانه اي، آزمايشگاه ريزپردازنده، کارگاه برق، آزمايشگاه رله و حفاظت و تست رله هاي سيستم قدرت، کارگاه مدار فرمان و مرکز تحقيقات IT، آزمايشگاه پايگاه داده و محاسبات سنگين، آزمايشگاه الکترونيک ديجيتال، آزمايشگاه منطقي و معماري، آزمايشگاه ريزپردارنده، آزمايشگاه ريز پردارنده پيشرفته\n"
                ,
                R.drawable.c1,
                "02331532699",
                "https://www.google.com/maps/place/%D8%AF%D8%A7%D9%86%D8%B4%DA%A9%D8%AF%D9%87+%D9%85%D9%87%D9%86%D8%AF%D8%B3%DB%8C+%D8%A8%D8%B1%D9%82+%D9%88+%DA%A9%D8%A7%D9%85%D9%BE%DB%8C%D9%88%D8%AA%D8%B1%E2%80%AD/@35.6002904,53.4335808,300m/data=!3m1!1e3!4m5!3m4!1s0x0:0x5c4789a2863bf148!8m2!3d35.5999309!4d53.4331548",
                "https://ece.semnan.ac.ir/"
            ),
            Faculty(
                "2",
                "دانشکده مهندسی عمران",
                "گروه مهندسي عمران در سال 1371با پذيرش دانشجو در مقطع کارشناسي در گرايش مهندسي عمران از زير مجموعه دانشکده مهندسي فعاليت خود را آغاز نمود. اين گروه از سال 1377 با پذيرش اولين گروه از دانشجويان کارشناسي ارشد سازه فعاليت تحصيلات تکميلي خود را آغاز نموده و در سال 1389 نيز اولين گروه از دانشجويان دورة دکتري مهندسي عمران از اين دانشکده فارغ التحصيل گرديدند.\n" +
                        "نهايتاً  در سال 1387 اين گروه به دانشکده مهندسي عمران ارتقاء يافت . در حال حاضر اين دانشکده با داشتن  1 رشته  - گرايش در مقطع کارشناسي و 6 رشته - گرايش در مقطع کارشناسي ارشد و 7 رشته - گرايش در مقطع دکتري مي باشد.\n" +
                        "رشته و گرایش های تحصیلی:\n" +
                        "مهندسي و مديريت منابع اب، مهندسي عمران، خاك و پي،  سازه، زلزله، مهندسي آب و سازه هاي هيدروليكي، راه و ترابري، ژئوتكنيك، مكانيك خاك و پي، مهندسي و مديريت ساخت.\n" +
                        " امکانات :\n" +
                        "آزمايشگاه پژوهشي سازه، آزمايشگاه قير و آسفالت، آزمايشگاه مکانيک خاک، آزمايشگاه پژوهشي هيدروليک، کارگاه نقشه برداري، آزمايشگاه مصالح ساختماني و تکنولوژي بتن.\n"
                        ,
                R.drawable.c2,
                "02331535200",
                "http://www.google.com/maps/place/Faculty+of+Civil+Engineering,+Semnan+University/@35.6060304,53.4332787,299m/data=!3m1!1e3!4m5!3m4!1s0x0:0xe94e8fcd40b2bf4a!8m2!3d35.6060304!4d53.4341955",
                "https://civil.semnan.ac.ir/"
            ),
            Faculty(
                "3",
                "دانشکده مهندسی مکانیک",
                "\n" +
                        "گروه مکانيک، از سال 1353 همزمان با تأسيس مدرسه عالي تکنولوژي سمنان، با پذيرش دانشجو دردو رشتة کارداني فعاليت خود را شروع کرد. اين گروه درسال 1374 با پذيرش دانشجو در مقطع کارشناسي و در سال 1381 در مقطع کارشناسي ارشد و در سال 1385 در مقطع دکتري فعاليتهاي خود را گسترش داد.\n" +
                        "نهايتاً  در سال 1389 اين گروه به دانشکده مهندسي مکانيک ارتقاء يافت. در حال حاضر اين دانشکده داراي 2رشته - گرايش در مقطع کارشناسي و 4 رشته -گرايش در مقطع کارشناسي ارشد و 7 رشته - گرايش در مقطع دکتري ميباشد.\n" +
                        "\n" +
                        "رشته و گرایش های تحصیلی:\n" +
                        "ساخت و  تولید، طراحي كاربردي- ديناميك، كنترل و ارتعاشات، طراحي كاربردي- مكانيك جامدات، تبديل انرژي، طراحي كاربردي، مهندسي مكانيك.\n" +
                        "\n" +
                        "\n" +
                        "امکانات:\n" +
                        "\n" +
                        "آزمايشگاه هاي تحقيقاتي:\n" +
                        "آزمايشگاه آناليز مودال، آزمايشگاه تست موتور، آزمايشگاه مکانيک ضربه، آزمايشگاه کاليبراسيون دما و فشار، آزمايشگاه انرژي و محيط متخلخل، آزمايشگاه انتقال حرارت پيشرفته، آزمايشگاه تونل باد عمودي، آزمايشگاه کاويتاسيون، آزمايشگاه رفتار مواد پيشرفته\n" +
                        "\n" +
                        "آزمايشگاه ها و کارگاه هاي آموزشي :\n" +
                        "آزمايشگاه ترموديناميک، آزمايشگاه پنوماتيک و هيدروليک، آزمايشگاه CNC، آزمايشگاه CAD/CAM، آزمايشگاه مکانيک سيالات، آزمايشگاه مقاومت مصالح، آزمايشگاه انتقال حرارت، آزمايشگاه ديناميک ماشين و ارتعاشات، آزمايشگاه سيستم هاي اندازه گيري، کارگاه جوشکاري و ورقکاري، کارگاه ماشين ابزار، کارگاه اتومکانيک.\n",
                R.drawable.c3,
                "02331532399",
                "https://www.google.com/maps/place/%D8%AF%D8%A7%D9%86%D8%B4%DA%A9%D8%AF%D9%87+%D9%85%DA%A9%D8%A7%D9%86%DB%8C%DA%A9%E2%80%AD/@35.5986856,53.4326774,178m/data=!3m2!1e3!4b1!4m5!3m4!1s0x3f9bb307f2c05ceb:0xddca06dbb8bc50b8!8m2!3d35.5986856!4d53.4332246",
                "https://mechanic.semnan.ac.ir/"
            ),
            Faculty(
                "4",
                "دانشکده مهندسي شيمي، نفت و گاز",
                "گروه مهندسي شيمي از سال 1379 باپذيرش دانشجو در مقطع کارشناسي مهندسي شيمي، گرايش صنايع شيميايي معدني، فعاليت خود را آغاز نمود. اين گروه در سال 1381 با ايجاد مقطع کارشناسي ارشد و درسال 1387در مقطع دکتري فعاليتهاي خود را گسترش داد.\n" +
                        "نهايتاً  در سال 1387 دانشکده مهندسي شيمي، نفت و گاز ايجاد و ساختمان جديد آن در 1388 به بهره برداري رسيد. در حال حاضر اين دانشکده داراي 1 رشته - گرايش در مقطع کارشناسي و6 رشته -گرايش در مقطع کارشناسي ارشد و 3 رشته - گرايش در مقطع دکتري مي باشد.\n" +
                        "\n" +
                        "رشته و گرایش های تحصیلی:\n" +
                        "مهندسی شیمی، ترمودینامیک و طراحی راکتورهای شیمیایی، پدیده های انتقال و فرایندهای جداسازی، فرآیندهای جداسازی، طراحی فرآیندهای  ، ترموسینتیک و کاتالیست  ، بهداشت، ایمنی و محیط زیست. \n" +
                        "\n" +
                        "امکانات :\n" +
                        "\n" +
                        "آزمايشگاه هاي تحقيقاتي:\n" +
                        "آزمايشگاه واکنش هاي گــاز - جــامد   دماي بالا، آزمايشگاه نانو سيال، آزمايشگاه جداسازي، آزمايشگاه هيدرات، آزمايشگاه پديده هاي انتقال، آزمايشگاه نانو تکــنولوژي تــبديلات انرژي و هيدراتهاي گازي، آزمايــشگاه تصــفيه پساب و مـواد نانو ساختار، آزمايشگاه نانو فرآيند ها و رئولوژي، آزمايشگاه نفت، آزمايشگاه فرآوري مواد معدني-آزمايشگاه مرجع گچ، آزمايشگاه عمليات واحد و کنترل فرآيند، آزمايشگاه عمومي.\n",
                R.drawable.c4,
                "02331532470",
                "https://www.google.com/maps/place/Chemical+Engineering+College/@35.601701,53.4341595,299m/data=!3m2!1e3!4b1!4m5!3m4!1s0x3f9bb3a9c1b5b96b:0x67a6bf1bd310edcd!8m2!3d35.601701!4d53.4350753",
                "https://che-p.semnan.ac.ir/"
            ),
            Faculty(
                "5",
                "دانشکده مهندسي مواد و متالورژي",
                "گروه آموزشي مهندسي مواد از سال 1356 با پذيرش دانشجو در مقطع کارداني با گرايش ريختهگري، فعاليت خود را آغاز نمود. اين گروه در سال 1375 با پذيرش دانشجو در مقطع کارشناسي و در سال 1379 در دوره کارشناسي ارشد و از سال 1389 پذيرش دانشجو در مقطع دکتري فعاليتهاي خود را گسترش داد.\n" +
                        "نهايتاً  در سال 1390 اين گروه به دانشکده مهندسي مواد و متالورژي ارتقاء يافت. در حال حاضر اين دانشکده داراي 3 رشته - گرايش در مقطع کارشناسي و 4 رشته -گرايش در مقطع کارشناسي ارشد و 8 رشته - گرايش در مقطع دکتري ميباشد.\n" +
                        "\n" +
                        "رشته و گرایش های تحصیلی:\n" +
                        "مهندسی مواد و متالورژی، خواص فیزیکی و مکانیکی مواد، سرامیک، خوردگی و پوشش و مهندسی سطح، جوشکاری اتصال مواد، شکل دادن فلزات، مواد پیشرفته، فرآیندهای استخراج فلزات و مواد، متالورژی پودر، شناسایی و انتخاب مواد مهندسی، شکل دادن فلزات، خوردگی و حفاظت مواد، ریخته گری، متالورژی صنعتی، متالورژی استخراجی. \n" +
                        "\n" +
                        "امکانات :\n" +
                        "آزمايشگاه ها و كارگاه هاي آموزشي: \n" +
                        " آزمايشگاه خواص مكانيكي مواد،  آزمايشگاه شكل دادن فلزات،  آزمايشگاه عمليات حرارتي،  آزمايشگاه مصالح قالبگيري و ماسه، آزمايشگاه انجماد،  آزمايشگاه متالوگرافي،  آزمايشگاه استخراج فلزات،  كارگاه قالبگيري و ريختهگري،  كارگاه مدلسازي و چوب،  کارگاه جوشکاري،  آزمايشگاه مواد و پيشرفته\n" +
                        "\n" +
                        "آزمايشگاه هاي تحقيقاتي:\n" +
                        "آزمايشگاه ميكروسكوپ الكتروني رويشي (SEM) آزمايشگاه آناليز مواد با اشعه ايكس  (XRD)، آزمايشگاه آناليز حرارتي (DTA/DSC)، آزمايشگاه ذوب فلزات در كوره القايي (در حال راهاندازي)، آزمايشگاه پوشش و خوردگي.\n",
                R.drawable.c5,
                "02331532399",
                "https://www.google.com/maps/place/%D8%AF%D8%A7%D9%86%D8%B4%DA%A9%D8%AF%D9%87+%D9%85%D9%87%D9%86%D8%AF%D8%B3%DB%8C+%D9%85%D9%88%D8%A7%D8%AF+%D9%88+%D9%85%D8%AA%D8%A7%D9%84%D9%88%D8%B1%DA%98%DB%8C%E2%80%AD/@35.5986222,53.4323126,19z/data=!3m1!4b1!4m11!1m5!8m4!1e2!2s115981540853015483352!3m1!1e1!3m4!1s0x3f9bb307ecb4a805:0xffc980aa0f34add7!8m2!3d35.5986222!4d53.4328598",
                "https://metal.semnan.ac.ir/"
            ),
            Faculty(
                "6",
                "دانشکده مهندسي (گروه صنايع)",
                "گروه مهندسي صنايع از سال 1388 با پذيرش دانشجو در مقطع کارشناسي و تحت عنوان گروه مهندسي صنايع، زير نظر دانشکده مهندسي، فعاليت خود را آغاز نمود. اين گروه از سال 1389 با پذيرش اولين ورودي از دانشجويان کارشناسي ارشد مديريت اجرايي-MBA  (گرايش هاي مديريت عمليات و مديريت تکنولوژي)، فعاليت تحصيلات تکميلي خود را آغاز نموده و در سال 1393 نيز اولين ورودي دانشجويان کارشناسي ارشد مهندسي صنايع - صنايع را جذب نمود. در نظر است در طي پنج سال آينده مطابق با برنامه پنج ساله توسعه آموزشي و پژوهشي فعاليت هاي خود را در ساير زمينه هاي مربوطه نيز ارتقاء بخشد. در حال حاضر اين گروه داراي 1 رشته - گرايش مقطع کارشناسي و 2 رشته - گرايش در مقطع کارشناسي ارشد مي باشد.\n" +
                        "\n" +
                        "رشته و گرایش های تحصیلی:\n" +
                        "صنایع، مهندسی صنایع - بهینه سازی سیستم ها، مدیریت کسب و کار  MBA) )- مدیریت عملیات و زنجیره تامین.\n",
                R.drawable.c6,
                "02331532399",
                "https://www.google.com/maps/place/%D8%AF%D8%A7%D9%86%D8%B4%DA%A9%D8%AF%D9%87+%D9%85%D9%87%D9%86%D8%AF%D8%B3%DB%8C+%D8%B5%D9%86%D8%A7%DB%8C%D8%B9%E2%80%AD/@35.5985048,53.4306025,714m/data=!3m2!1e3!4b1!4m11!1m5!8m4!1e4!2s108551622807482334741!3m1!1e1!3m4!1s0x3f9bb3c57949d6c3:0x9bc60cb9b027ea97!8m2!3d35.5985048!4d53.4327912",
                "https://ie.semnan.ac.ir/"
            ),
            Faculty(
                "7",
                "دانشکده رياضي، آمار و علوم کامپيوتر",
                "\n" +
                        "اين دانشکده از کنار هم قرار گرفتن سه گروه آموزشي رياضي، آمار و علوم کامپيوتر تشکيل شده است. قديميترين گروه آموزشي اين دانشکده گروه رياضي است که شروع فعاليت آن به سال 1369 بر ميگردد. پس از آن گروه آمار از سال 1386 و سپس گروه علوم کامپيوتر از سال 1387 فعاليت خود را آغاز نمود. نهايتاً در سال 1389 مجوز تأسيس اين دانشکده صادر گرديد. در حال حاضر اين دانشکده داراي 3 رشته- گرايش در مقطع کارشناسي و12رشته -گرايش در مقطع کارشناسي ارشد و 5 رشته - گرايش در مقطع دکتري ميباشد. رشته و گرایش های تحصیلی: آمار ریاضی، آمار، علوم کامپیوتر، گراف و ترکیبات، ریاضی محض - آنالیز، ریاضی محض - جبر، ریاضی محض - هندسه، ریاضی کاربردی - آنالیز عددی، ریاضی کاربردی - تحقیق در عملیات، ریاضی کاربردی - ریاضیات مالی، ریاضی کاربردی -گراف و ترکیبیات، هندسه توپولوژی (کاربرد هندسه در علوم رباتیک)، ریاضی کاربردی معادلات دیفرانسیل و سیستم های دینامیکی، بهینه سازی، رمز و کد، ریاضیات و کاربردها. ",
                R.drawable.c7,
                "02331535757",
                "https://www.google.com/maps/place/Computer+Science+and+Mathematics+College/@35.600177,53.4332084,17z/data=!4m13!1m7!3m6!1s0x3f9bb3497d92a7b7:0xbdc066f7c9de11ce!2sSemnan,+Semnan+Province,+Iran!3b1!8m2!3d35.578797!4d53.3798108!3m4!1s0x0:0x43b642199948064d!8m2!3d35.6023732!4d53.4369159",
                "https://msc.semnan.ac.ir/"
            ),
            Faculty(
                "8",
                "دانشکده فيزيک",
                "گروه آموزشي فيزيک از سال 1376 به عنوان يکي از گروه هاي دانشکده علوم پايه اقدام به پذيرش دانشجوي کارشناسي فيزيک کاربردي نمود. اين گروه در سال 1381 با جذب اولين گروه دانشجويان کارشناسي ارشد و در سال 1386 با پذيرش اولين گروه دانشجويان دکتري، فعاليت خود را در مقاطع تحصيلات تکميلي گسترش داد. نهايتاً در سال 1390 گروه فيزيک به دانشکده فيزيک ارتقاء يافت. در حال حاضر اين دانشکده با داشتن 4 رشته - گرايش کارشناسي و 3 رشته -گرايش در مقطع کارشناسي ارشد و 4 رشته - گرايش در مقطع دکتري ميباشد. رشته و گرایش های تحصیلی: فیزیک، فیزیک - حالت جامد، فیزیک - نجوم، فیزیک - گرانش، فیزیک - ذرات بنیادی، فیزیک - گرانش و نجوم، فیزیک - هسته ای، فیزیک - اتمی، فیزیک مهندسی. امکانات : آزمايشگاه هاي پايه: آزمايشگاه فيزيک 1، آزمايشگاه فيزيک 2 ( الکتريسيته و مغناطيس )، آزمايشگاه فيزيک3 آزمايشگاه هاي تخصصي: آزمايشگاه اپتيک، آزمايشگاه فيزيک حالت جامد، آزمايشگاه فيزيک مدرن آزمايشگاه هاي تحقيقاتي: آزمايشگاه لايه نشاني، آزمايشگاه رشد بلور از محلول، آزمايشگاه رشد بلورها و نانو مواد، آزمايشگاه قطعات نانوساختاري، آزمايشگاه نانو مواد اپتيکي، آزمايشگاه نانو مواد مغناطيسي، آزمايشگاه پرتو کيهاني، آزمايشگاه آموزشي و تحقيقاتي ليزر. ",
                R.drawable.c8,
                "02331532242",
                "https://www.google.com/maps/place/%D8%AF%D8%A7%D9%86%D8%B4%DA%A9%D8%AF%D9%87+%D9%81%DB%8C%D8%B2%DB%8C%DA%A9%E2%80%AD/@35.6018198,53.4378587,102m/data=!3m1!1e3!4m11!1m5!8m4!1e4!2s108551622807482334741!3m1!1e1!3m4!1s0x3f9bb3c87d38059f:0x4c1ae3f0c7f3ccb8!8m2!3d35.6017692!4d53.4376519",
                "https://physics.semnan.ac.ir/"
            ),
            Faculty(
                "20",
                "دانشکده شيمي",
                "گروه آموزشي شيمي کاربردي از سال 1382 به عنوان يکي از گروه هاي دانشکده علوم پايه با پذيرش دانشجوي کارشناسي شيمي کاربردي کار خود را آغاز نمود و در سال 1384با جذب دانشجويان کارشناسي ارشد و در سال 1389 با پذيرش دانشجويان دکتري، فعاليت خود را در مقاطع تحصيلات تکميلي گسترش داد. نهايتاً در سال 1390 گروه شيمي با چهار گروه آموزشي به دانشکده شيمي ارتقاء يافت و در ساختمان تازه تأسيس خود مستقر گرديد. در حال حاضر اين دانشکده داراي 1 رشته- گرايش در مقطع کارشناسي و 5 رشته -گرايش در مقطع کارشناسي ارشد و 5 رشته - گرايش در مقطع دکتري ميباشد. رشته و گرایش های تحصیلی: شیمی کاربردی، شیمی معدنی، شیمی تجزیه، شیمی آلی، شیمی فیزیک. امکانات: آزمايشگاه هاي آموزشي : آزمايشگاه شيمي عمومي ، آزمايشگاه شيمي تجزيه، آزمايشگاه شيمي فيزيك، آزمايشگاه شيمي معدني، آزمايشگاه شيمي آلي و جداسازي، آزمايشگاه شيمي و تكنولوژي رنگ، آزمايشگاه تصفيه آب و پساب هاي صنعتي، آزمايشگاه تجزيه نمونه هاي حقيقي. آزمايشگاه هاي تحقيقاتي: آزمايشگاه تحقيقاتي شيمي فيزيك، آزمايشگاه تحقيقاتي شيمي معدني، آزمايشگاه تحقيقاتي شيمي آلي، آزمايشگاه تحقيقاتي شيمي كاربردي ",
                R.drawable.c20,
                "02331532800",
                "https://www.google.com/maps/place/Faculty+of+Chemistry/@35.6018152,53.435197,204a,35y,21.37h/data=!3m1!1e3!4m5!3m4!1s0x0:0xc86ab0b0c4be5c76!8m2!3d35.602216!4d53.4377841",
                "https://chem.semnan.ac.ir/"
            ),
            Faculty(
                "9",
                "دانشکده علوم پايه (گروه زيست شناسي )",
                "\n" +
                        "اين دانشکده در سال 1371 مجوز تأسيس خود را دريافت نموده است و در حال حاضر با يک گروه آموزشي که از سال 1389 با پذيرش دانشجو راه اندازي شده، مشغول به فعاليت مي باشد . در حال حاضر اين دانشکده داراي 1رشته در مقطع کارشناسي ميباشد. رشته و گرایش های تحصیلی: زیست شناسی سلولی و مولکولی ",
                R.drawable.c9,
                "02331532220",
                "https://www.google.com/maps/place/Science+College/@35.6016781,53.4346169,17z/data=!4m11!1m5!8m4!1e2!2s115981540853015483352!3m1!1e1!3m4!1s0x3f9bb3a906112fcd:0x4f34f097e1974160!8m2!3d35.6016781!4d53.4368056",
                "https://biology.semnan.ac.ir/"
            ),
            Faculty(
                "10",
                "دانشکده علوم انساني",
                "در سال 1373 اولين رشته هاي علوم انساني دانشگاه سمنان با پذيرش دانشجو دررشته هاي الهيات (دبيري) و مديريت بازرگاني ايجاد گرديد. با گسترش فعاليت هاي گروه هاي آموزشي علوم انساني و با پيگيري هاي صورت گرفته، نهايتاً در سال 1376با مجوز شوراي گسترش آموزش عالي، دانشکده علوم انساني تاسيس شد. با گسترش رشته هاي مختلف، اين دانشکده در سال 1387 به دو دانشکده علوم انساني و اقتصاد، مديريت و علوم اداري تفکيک گرديد . اين دانشکده که از نخستين دانشکده هاي دانشگاه سمنان محسوب مي شود، هم اکنون به عنوان بزرگترين دانشکده جامع علوم انساني استان سمنان فعاليت مي نمايد. در حال حاضر اين دانشکده داراي 7 رشته - گرايش در مقطع کارشناسي، 21 رشته- گرايش در مقطع کارشناسي ارشد و 4 رشته - گرايش در مقطع دکتري مي باشد. رشته و گرایش های تحصیلی: الهیات (ادیان و عرفان تطبیقی)،دین شناسی،عرفان و تصوف، عرفان اسلامی، فقه و مبانی حقوق اسلامی، فقه و مبانی حقوق اسلامی، فیزیولوژی ورزشی کاربردی، علوم ورزشی،فیزیولوژی ورزشی محض، فیزیولوژی ورزشی تندرستی، یادگیری و کنترل حرکتی، رشد حرکتی، حقوق، حقوق عمومی، حقوق خصوصی، حقوق اقتصادی، زبان و ادبیات فارسی، ادبیات پایداری، زبان و ادبیات عربی، مترجمی زبان عربی، زبان شناسی همگانی، آموزش زبان فارسی به غیر فارسی زبانان، زبان و ادبیات انگلیسی. امکانات : آزمايشگاه (لابراتوار) زبان، آزمايشگاه تربيت بدني ",
                R.drawable.c10,
                "02331532100",
                "https://www.google.com/maps/place/Department+Of+Human+Sciences/@35.6026698,53.4327578,19z/data=!3m1!4b1!4m11!1m5!8m4!1e2!2s115981540853015483352!3m1!1e1!3m4!1s0x3f9bb300ae87f25b:0x658972129dac61f6!8m2!3d35.6026698!4d53.433305",
                "https://human.semnan.ac.ir/"
            ),
            Faculty(
                "11",
                "دانشکده اقتصاد، مديريت و علوم اداري",
                "تأسيس رشته مديريت بازرگاني در مقطع کارشناسي در سال 1373 و در سالهاي بعد اضافه شدن مقطع کارشناسي ارشد مديريت بازرگاني و راه اندازي گرايشهاي مختلف مديريت، رشته هاي علوم اقتصادي و حسابداري به دانشکده علوم انساني، زمينه ايجاد دانشکدهاي مستقل مرتبط به امور مالي را فراهم نمود که اين امر در سال 1387 تحقق يافت . نهايتاً در سال 1390با تصويب تشکيلات دانشکده از سوي مراجع ذيربط، نام دانشکده تحت عنوان دانشکده اقتصاد، مديريت و علوم اداري ثبت شد. در حال حاضر اين دانشکده داراي 6 رشته - گرايش در مقطع کارشناسي و 12 رشته -گرايش در مقطع کارشناسي ارشد و 12 رشته - گرايش در مقطع دکتري مي باشد. رشته و گرایش های تحصیلی: مدیریت بازرگانی گرایش مدیریت بازاریابی، مدیریت گرایش تحقیق در عملیات، مدیریت صنعتی گرایش تولید و عملیات، مدیریت گرایش مدیریت سیستم ها، مدیریت دولتی گرایش تصمیم گیری و خط مشی گذاری عمومی، مدیریت دولتی گرایش رفتار سازمانی، مدیریت دولتی گرایش مدیریت منابع انسانی، مدیریت صنعتی گرایش مالی، کارآفرینی گرایش کسب و کار جدید، مدیریت کسب و کار گرایش مدیریت مالی، مدیریت کسب و کار گرایش بازاریابی، مدیریت کسب و کار گرایش مدیریت استراتژی، مدیریت کسب و کار گرایش سیستم های اطلاعاتی وفناوری اطلاعات، مدیریت کسب و کار گرایش فناوری، بازرگانی گرایش مدیریت بازاریابی، مدیریت کسب و کار گرایش رفتار سازمانی و منابع انسانی، مدیریت گرایش تولید و عملیات، مدیریت صنعتی، مدیریت بازرگانی، مدیریت کسب و کارهای کوچک، مدیریت دولتی، علوم اقتصادی، اقتصاد مالی، اقتصاد نظری، علوم اقتصادی گرایش اقتصاد پولی، علوم اقتصادی گرایش اقتصاد سنجی، علوم اقتصادی گرایش اقتصاد بین الملل، علوم اقتصادی گرایش اقتصاد بخش عمومی، حسابداری ",
                R.drawable.c11,
                "02331532596",
                "https://www.google.com/maps/contrib/115981540853015483352/place/ChIJgVTYUQezmz8R_jq9ClD3Thw/@35.6019912,53.4332333,19z/data=!4m6!1m5!8m4!1e2!2s115981540853015483352!3m1!1e1",
                "https://gsme.semnan.ac.ir/"
            ),
            Faculty(
                "12",
                "دانشکده هنر ",
                "دانشکده هنر بنا به اقتضاي هويت فرهنگي استان و شهرستان سمنان و نيز کمبودهاي منطقه با پذيرش دانشجو در رشته صنايع دستي در سال 1380 تأسيس شد. در حال حاضر اين دانشکده داراي 11رشته - گرايش کارشناسي و 2 رشته -گرايش در مقطع کارشناسي ارشد، است. رشته و گرایش های تحصیلی: پژوهش هنر، ارتباط تصویری، صنایع دستی، گرایش طراحی، فرش گرایش بافت و مرمت، فرش طراحی و چاپ پارچه، نقاشی، عکاسی، طراحی صنعتی، مرمت و احیای بناهای تاریخی، مهندسی معماری، مهندسی شهرسازی. امکانات: آتليه تخصصي گرافيگ، آتليه نورپردازي، آتليه عكاسي سياه و سفيد ، آتليه عكاسي رنگي ، آزمايشگاه رنگرزي شيمي ، كارگاه بافت پارچه، كارگاه چاپ سيلك اسكرين، كارگاه چاپ باتيك ، كارگاه چاپ سنتي ، كارگاه طراحي و بافت فرش ، كارگاه نقاشي ، كارگاه طراحي ، كارگاه چوب، كارگاه سفال، كارگاه جواهرسازي، كارگاه قلم زني ، كارگاه تراش شيشه و فيوزينگ، كارگاه حجم سازي، كارگاه مرمت آثار، كارگاه پلاستيك ، كارگاه چوب ، كارگاه فلز، كارگاه جوشكاري، سالن گالري (جهت نمايش آثار)، مرکز اسناد و آثار ",
                R.drawable.c12,
                "02331535305",
                "https://www.google.com/maps/place/School+of+Art+of+Semnan+University/@35.590755,53.43312,17z/data=!3m1!4b1!4m11!1m5!8m4!1e2!2s115981540853015483352!3m1!1e1!3m4!1s0x3f9bb3a063a6e951:0xec690f5ea26e235e!8m2!3d35.590755!4d53.4346676",
                "https://art.semnan.ac.ir/"
            ),
            Faculty(
                "13",
                "دانشکده روانشناسي و علوم تربيتي",
                "این واحد آموزشي در سال 1370 با نام دانشکده تربيت دبير فعاليت خود را زمينه تربيت نيروي انساني رياضي محض و دبيري رياضي آغاز نمود. سپس در سال 1382 بنابر نياز جامعه و منطقه ، به دانشکده روانشناسي و علوم تربيتي تغيير نام داده ودر مقطع کارشناسي روانشناسي باليني اقدام به جذب دانشجو نمود. در حال حاضر اين دانشکده با داشتن 4 رشته -گرايش در مقطع کارشناسي ، 4 رشته -گرايش در مقطع کارشناسي ارشد و 3 رشته - گرايش در مقطع دکتري ميباشد. رشته و گرایش های تحصیلی: روانشناسی، روانشناسی عمومی، روانشناسی بالینی، روانشناسی تربیتی، روانشناسی- آموزش و پرورش و کودکان استثنایی، علم اطلاعات و دانش شناسی، مدیریت آموزشی. امکانات: آزمايشگاه فيزيولوژي ، آزمايشگاه تجربي و جانوري ، كارگاه علم اطلاعات. ",
                R.drawable.c13,
                "02333623300",
                "https://www.google.com/maps/place/%D8%AF%D8%A7%D9%86%D8%B4%DA%A9%D8%AF%D9%87+%D8%AA%D8%B1%D8%A8%DB%8C%D8%AA+%D8%AF%D8%A8%DB%8C%D8%B1+%D9%85%D9%87%D8%AF%DB%8C%D8%B4%D9%87%D8%B1%E2%80%AD/@35.7378866,53.3582783,17z/data=!3m1!4b1!4m11!1m5!8m4!1e2!2s115981540853015483352!3m1!1e1!3m4!1s0x3f9a551c8277cadf:0x743a3230c4869587!8m2!3d35.7378866!4d53.360467",
                "httpس://psy.semnan.ac.ir/"
            ),
            Faculty(
                "14",
                "دانشکده دامپزشکي",
                "دانشکذه دامپزشکي در سال 1388تأسيس گرديد و اولين دوره دانشجويان رشته دکتراي حرفه اي دامپزشکي را جذب نمود. در حال حاضر اين دانشکده با داشتن 2رشته - گرايش در مقطع کارشناسي ، 2 رشته -گرايش در مقطع کارشناسي ارشد و 1 رشته - گرايش در مقطع دکتري عمومي ميباشد. رشته و گرایش های تحصیلی: دامپزشکی، انگل شناسی، علوم آزمایشگاهی دامپزشکی، مهندسی کشاورزی علوم دامی- تغذیه دام، مهندسی کشاورزی مهندسی علوم دامی ، مهندسی کشاورزی مهندسی علوم و صنایع غذایی. امکانات : آزمايشگاه بيوشيمي و کلينيکال پاتولوژي، سالن تشريح و کالبد گشايي ، آزمايشگاه بافت شناسي و آسيب شناسي ، آزمايشگاه فيزيولوژي، فارماکولوژي و سم شناسي ، آزمايشگاه ميکروبيولوژي و ايمني شناسي ، آزمايشگاه انگل شناسي ، آزمايشگاه ميکروبيولوژي موادغذايي ، آزمايشگاه تغذيه و شيمي مواد غذايي، آزمايشگاه مرکزي (تحقيقات پيشرفته)، آزمايشگاه HPLC، کارگاه تهيه نمونه هاي تشريحي مورد مطالعه در کالبد شناسي ، کارگاه تهيه نمونه هاي انگل شناسي ، انبار مواد آزمايشگاهي، سالن محلول سازي و استريليزاسيون، آزمايشگاه آبزيان، کلينيک دام هاي کوچک (شامل سالن جراحي، سالن راديولوژي و آزمايشگاه و سالن معاينه)، کلينيک دام هاي بزرگ (شامل سالن معاينه، سالن مقيد کردن .....)، سايت نگهداري قوچ وحشي، گاوداري ",
                R.drawable.c14,
                "02331532626",
                "https://www.google.com/maps/place/Faculty+of+Veterinary+Medicine/@35.6080035,53.4372053,178m/data=!3m1!1e3!4m11!1m5!8m4!1e2!2s115981540853015483352!3m1!1e1!3m4!1s0x0:0xe9c38ffe27b935f!8m2!3d35.6081457!4d53.4373713",
                "https://vet.semnan.ac.ir/"
            ),
            Faculty(
                "15",
                "آموزشکده دامپزشکي",
                "آموزشکذه دامپزشکي، در سال 1370 در مقطع کارداني دامپزشکي شروع به فعاليت نمود و از سال 1374 شروع به پذيرش دانشجو در دوره کارشناسي ناپيوسته علوم آزمايشگاهي نمود که تاکنون نيز ادامه دارد. رشته و گرایش های تحصیلی: دامپزشکی، علوم آزمایشگاهی دامپزشکی امکانات آموزشي: آزمايشگاه باکتري شناسي، آزمايشگاه بهداشت مواد غذايي ، آزمايشگاه کلينيکال پاتولوژي ، آزمايشگاه بيوشيمي ، آزمايشگاه فيزيولوژي ، آزمايشگاه فارماکولوژي، آزمايشگاه انگل شناسي، آزمايشگاه بافت شناسي، آزمايشگاه آسيب شناسي ، آزمايشگاه قارچ شناسي، آزمايشگاه تجزيه خوراک دام، آزمايشگاه حيوانات آزمايشگاهي، آزمايشگاه مولکولي، سالن آناتومي، سالن جراحي، سالن کالبد گشايي، فارم آموزشي گاوشيري امکانات پژوهشي: مرکز پرورش و تحقيقات حيوانات آزمايشگاهي، آزمايشگاه تحقيقاتي مولکولي، آزمايشگاه کلينيکال پاتولوژي ، آزمايشگاه تجزيه خوراک دام، آزمايشگاه بافت شناسي ",
                R.drawable.c15,
                "02333664891",
                "https://www.google.com/maps/place/%D8%A2%D9%85%D9%88%D8%B2%D8%B4%DA%A9%D8%AF%D9%87+%D8%AF%D8%A7%D9%85%D9%BE%D8%B2%D8%B4%DA%A9%DB%8C+%D8%AF%D8%A7%D9%86%D8%B4%DA%AF%D8%A7%D9%87+%D8%B3%D9%85%D9%86%D8%A7%D9%86%E2%80%AD/@35.7760566,53.3432552,712m/data=!3m2!1e3!4b1!4m11!1m5!8m4!1e4!2s108551622807482334741!3m1!1e1!3m4!1s0x3f9aff137eb0ba9f:0x53ebcd13cfadbf14!8m2!3d35.7760566!4d53.3454439",
                "https://vetsh.semnan.ac.ir/"
            ),
            Faculty(
                "16",
                "دانشکده گردشگري",
                "این دانشکده در حال حاضر در نوع خود جزء اولين دانشکده هاي موجود در کشور مي باشد در سال 1386 افتتاح گرديد. در حال حاضر اين دانشکده با داشتن 2رشته - گرايش کارشناسي و 3 رشته -گرايش در مقطع کارشناسي ارشد است. رشته و گرایش های تحصیلی: مدیریت جهانگردی، برنامه ریزی توسعه جهانگردی، بازاریابی جهانگردی، طبیعت گردی (اکوتوریسم). ",
                R.drawable.c16,
                "02331535570",
                "https://www.google.com/maps/place/%D8%AF%D8%A7%D9%86%D8%B4%DA%A9%D8%AF%D9%87+%DA%AF%D8%B1%D8%AF%D8%B4%DA%AF%D8%B1%DB%8C%E2%80%AD/@35.603602,53.4278685,797m/data=!3m2!1e3!4b1!4m11!1m5!8m4!1e4!2s108551622807482334741!3m1!1e1!3m4!1s0x3f9bb3dac1ef6e7d:0x6b320f3e84b4f91a!8m2!3d35.603602!4d53.4300625",
                "https://tourist.semnan.ac.ir/"
            ),
            Faculty(
                "17",
                "دانشکده کوير شناسي",
                "دانشکده کوير شناسي دانشگاه سمنان به عنوان اولين دانشکده کوير شناسي در سطح کشور در سال 1386راهاندازي و با پذيرش دانشجو در رشتة بيابان زدايي در مقطع کارشناسي ارشد به طور رسمي فعاليت آموزشي و پژوهشي خود را آغاز نمود و در سال 1387 در اولين دوره مقطع کارشناسي رشته مديريت مناطق خشک و بياباني نيز دانشجو پذيرفت. در حال حاضر اين دانشکده داراي 2 رشته - گرايش مقطع کارشناسي و 3 رشته -گرايش در مقطع کارشناسي ارشد و 1 رشته- گرايش در مقطع دکتري ميباشد. رشته و گرایش های تحصیلی: مديريت و کنترل بيابان ، مديريت و کنترل بيابان ، علوم و مهندسی آب ، هواشناسی کشاورزی ، علوم و مهندسی جنگل ، علوم زيستی جنگل ، علوم و مهندسی جنگل ، مهندسی طبيعت . امکانات: ايستگاه هواشناسي خودکار، مزرعه آموزشي و تحقيقاتي",
                R.drawable.c17,
                "02331535570",
                "https://www.google.com/maps/place/%D8%AF%D8%A7%D9%86%D8%B4%DA%A9%D8%AF%D9%87+%DA%A9%D9%88%DB%8C%D8%B1%D8%B4%D9%86%D8%A7%D8%B3%DB%8C%E2%80%AD/@35.6029177,53.4278088,797m/data=!3m2!1e3!4b1!4m11!1m5!8m4!1e4!2s108551622807482334741!3m1!1e1!3m4!1s0x3f9bb3199d73714f:0x2f7e29e49dae1717!8m2!3d35.6029177!4d53.4300028",
                "https://desert.semnan.ac.ir/"
            ),
            Faculty(
                "18",
                "دانشکده منابع طبيعي",
                "دانشکده منابع طبيعي پس از اخذ موافقت اصولي و قطعي تأسيس در سال 1390 با جذب نيروي انساني عالم، متعهد و دلسوز در سال 1391 فعاليت خود را باراه اندازي رشته کارشناسي مهندسي منابع طبيعي - مرتع و آبخيزداري (مهندسي طبيعت فعلي) آغاز نمود. در حال حاضر اين دانشکده داراي 3 رشته - گرايش در مقطع کارشناسي ميباشد. رشته و گرایش های تحصیلی: مهندسی منابع طبیعی ، صنایع چوب و فراورده های سلولزی، محیط زیست، مرتع و آبخیز داری. امکانات: آزمايشگاه مهندسي علوم و محيط زيست، آزمايشگاه مهندسي صنايع چوب و فرآورده هاي سلولزي، آزمايشگاه مهندسي طبيعت ، سايت کامپيوتر (محل برگزاري کارگاهاي سنجش از راه دور و Gis)، گلخانه آموزشي (جهت آموزش کشت و تکثير براي دانشجويان)، کتابخانه تخصصي رشته هاي منابع طبيعي ، سالن تنيس روي ميز ، ",
                R.drawable.c18,
                "02333626322",
                "https://www.google.com/maps/place/Semnan+Province,+Mehdi+Shahr,+Enghelab+blvd.,+%D8%AF%D8%A7%D9%86%D8%B4%DA%A9%D8%AF%D9%87+%D9%85%D9%86%D8%A7%D8%A8%D8%B9+%D8%B7%D8%A8%DB%8C%D8%B9%DB%8C+%D9%85%D9%87%D8%AF%DB%8C%D8%B4%D9%87%D8%B1%D8%8C+Iran%E2%80%AD/@35.7111493,53.357581,796m/data=!3m2!1e3!4b1!4m11!1m5!8m4!1e4!2s108551622807482334741!3m1!1e1!3m4!1s0x3f9a54925c548fd3:0x6da2d155614f8d83!8m2!3d35.7111936!4d53.3597822?hl=en",
                "https://nature.semnan.ac.ir/"
            ),
            Faculty(
                "19",
                "پرديس علوم و فناوريهاي نوين",
                "پردیس علوم و فناوريهاي نوين با پذيرش دانشجو در سال 1390 در 9 گروه آموزشي فعاليت خود را آغاز نموده است. اين پرديس مشتمل بر دانشکده هاي مهندسي نفت، مهندسي هوافضا، مهندسي نانوفناوري و مهندسي بيوفناوري و دو گروه علوم شناختي و سيستمهاي انرژي ميباشد. در حال حاضر اين پرديس داراي 12 رشته -گرايش در مقطع کارشناسي ارشد و 3 رشته - گرايش در مقطع دکتري ميباشد. رشته و گرایش های تحصیلی: مخازن هيدروكربوري، اكتشاف نفت، مهندسی شيمي _ نانو فناوری، مهندسی نانو مواد، زيست فناوري (بيوتكنولوژي) ميكروبي، مهندسی پزشکی - بيومواد، مهندسی پزشکی - بيوالكتريك، جلوبرندگي، طراحی سازه اي هوافضایي، روانشناسی شناختی، مهندسی سیستم های انرژی– تکنولوژی، مهندسی سیستم های انرژی– انرژی محیط زیست. امکانات: آزمايشگاه خواص سيالات مخزني، آزمايشگاه خواص سنگ/ ژئوشيمي آلي ",
                R.drawable.c19,
                "02331535400",
                "https://www.google.com/maps/place/Semnan+University/@35.5759107,53.3884688,127m/data=!3m1!1e3!4m11!1m5!8m4!1e4!2s108551622807482334741!3m1!1e1!3m4!1s0x0:0xa8b9a579932bb5a1!8m2!3d35.5761115!4d53.3884075",
                "https://newtech.semnan.ac.ir/"
            )
        )
    }


}